Revit 2023 API
GroupTypeId.ElectricalAnalysis Property
 "Electrical Analysis"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId ElectricalAnalysis { get; }
Visual Basic
Public Shared ReadOnly Property ElectricalAnalysis As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElectricalAnalysis {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace